OpenFOAM-5.x/tutorials/demo/simpleCoronary/system/MeshingInfo
baseGridSize 0.0035;
