OpenFOAM-5.x/tutorials/demo/simpleCoronary/system/PatientInfo
patientInfo {
    MAP 96.2133; // mmHg
    HR  60;
    SBP 120;
    MyocardialDensity 1.06; // g/mL
    MyocardialVolume 147.755; // mL
}
