OpenFOAM-5.x/tutorials/demo/simpleCoronary/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//numberOfSubdomains 8;

#include "numberOfSubdomains"

method          metis;

metisCoeffs
{
//    processorWeights ( 1 1 1 1 1 1 1 1 );
    #include "processorWeights"
}


distributed     no;

roots           ( );


// ************************************************************************* //
