OpenFOAM-5.x/tutorials/demo/simpleCoronary/system/numberOfSubdomains
numberOfSubdomains 6;
