OpenFOAM-5.x/tutorials/demo/simpleCoronary/system/processorWeights
processorWeights ( 1 1 1 1 1 1 );
